# ViewSchemaSettingForSystem Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ViewSchemaSettingForSystem Property
ParameterTypeId Class See Also
---
"System Color Schemes"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ViewSchemaSettingForSystem { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ViewSchemaSettingForSystem As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ViewSchemaSettingForSystem {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace